#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_psa-digital-journeys-2311.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9799a192-c510-48e9-b927-7b00e1aa20f4]
module.keycloak_test.module.onestopauth.module.client_bcea-forecast-2410.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ddb82a36-a817-4f48-b668-d3f935f147c5]
module.keycloak_test.module.onestopauth.module.client_bcea-forecast-2410.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d8512794-1a3f-4975-b111-07ede7757515]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=69643de7-f9e4-4c46-8546-73c3b82ec494]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_openid_client.this: Refreshing state... [id=ead9ec4b-834c-45b3-a339-d393c21d3a10]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=29bb3938-00e4-46f2-af82-5ee0b1ef78b8]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=789ba9c5-cd38-4cf5-b975-87dad66bb265]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2af61adf-b710-49ab-90a4-f7c758884e54]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce7f27cf-d633-4652-a78a-3d30c90b5db2]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=282987c8-188f-47e5-9791-f9839fc166ab]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c13e6019-bbf4-4f12-a7bd-60c3a21b1977]
module.keycloak_test.module.onestopauth.module.client_work-bc-job-board-496.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c97a113e-75ac-4105-a006-9ff0eb217b0d]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=e326e182-06ba-4007-b111-a34a369001ba]
module.keycloak_test.module.onestopauth.module.client_psa-digital-journeys-2311.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=a4852ca7-a3ef-49cb-8f54-492f940afe98]
module.keycloak_test.module.onestopauth.module.client_psa-digital-journeys-2311.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=656bf92c-92dc-4bdd-b89b-4a22b31df015]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1750.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=04e0df49-bf25-4ea7-b4d5-5c13441f58e6]
module.keycloak_test.module.onestopauth.module.client_psa-digital-journeys-2311.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b1636072-bd18-4e0a-8339-7f211f78b237]
module.keycloak_test.module.onestopauth.module.client_psa-digital-journeys-2311.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8a3f4caa-ded0-44f5-b822-63af3e55b59c]
module.keycloak_test.module.onestopauth.module.client_psa-digital-journeys-2311.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f94dc930-0aab-4e99-af88-68689609f10d]
module.keycloak_test.module.onestopauth.module.client_psa-digital-journeys-2311.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4a402449-9061-46a4-8bb5-a831cd4bf5bc]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1750.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=47565719-f87a-49de-bf4f-bb7e277c157f]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1750.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0676dc3f-17e8-4f04-8f9f-4b17f41a4527]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1750.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=907fb2d5-7f57-497a-b61e-46fdee4475be]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1750.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=609b91d5-5742-43fb-8368-b3c085e305fe]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1750.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=54710f8a-56c5-4fbf-a540-70d0e0e89d09]
module.keycloak_test.module.onestopauth.module.client_tidd-trade-industry-development-2575.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fe15441e-3a27-41b5-a5ab-01e6015c145e]
module.keycloak_test.module.onestopauth.module.client_tidd-trade-industry-development-2575.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8f013e04-5fb9-475c-8e89-7fd3c830ea6f]
module.keycloak_test.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f91f9cca-ab28-401e-ae37-c8c0a0872b1c]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1750.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f6c0bd6f-ade9-4332-bc2d-6d5a1d6374ea]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8243acb3-99ef-4c49-a4dd-31ca6ff8ea46]
module.keycloak_test.module.onestopauth.module.client_tidd-trade-industry-development-2575.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=46c515c8-4118-4b5e-a68b-bb8795a5896e]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1750.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=62ac46fb-bf58-45b4-8bfb-0b69511e3f4c]
module.keycloak_test.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2ac66cb1-831e-4d0f-94bb-ecc53ecbf491]
module.keycloak_test.module.onestopauth.module.client_tidd-trade-industry-development-2575.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8da2aeab-8b47-4973-ba91-487be986596c]
module.keycloak_test.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c02fabfd-686c-43b1-b1d6-3ae51cabe96c]
module.keycloak_test.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1a07d847-a45b-4d7f-b74c-cfc0e53a8f15]
module.keycloak_test.module.onestopauth.module.client_tidd-trade-industry-development-2575.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b3863be3-08d7-49e2-a842-df86fd1fad5e]
module.keycloak_test.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0dad99b2-cc1d-4193-a7a6-136bcd1348f4]
module.keycloak_test.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0686dd9e-9b90-47ed-8796-b128d2caa729]
module.keycloak_test.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f10d5172-94cb-4f31-865b-868021443380]
module.keycloak_test.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c723d134-1e13-4c48-b181-1a7a1bfed73e]
module.keycloak_test.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=61533d86-c051-4403-9ff0-3b9bf064e810]
module.keycloak_test.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=26831117-ede1-46fa-b9c9-82ead77c5052]
module.keycloak_test.module.onestopauth.module.client_tidd-trade-industry-development-2575.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ec344c94-bc1d-48b9-8cce-87eba52c39b0]
module.keycloak_test.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7ddbed7d-ce06-496e-a94a-c5becc5d75b4]
module.keycloak_test.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=51952ca9-5233-4da4-b059-6081514e32f1]
module.keycloak_test.module.onestopauth.module.client_tidd-trade-industry-development-2575.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=12180978-24e9-454f-8bcb-474effdb49dc]
module.keycloak_test.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f929328c-90f5-45a8-b8df-18489dd49cac]
module.keycloak_test.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=87009b37-9653-4b80-88a3-66f9277aea9b]
module.keycloak_test.module.onestopauth.module.client_tti-ams-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d3a6db03-a8a1-43d7-8bed-88368cf1cc8d]
module.keycloak_test.module.onestopauth.module.client_tidd-trade-industry-development-2575.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d1815c7a-e86a-4096-a10f-7b932b0b9b93]
module.keycloak_test.module.onestopauth.module.client_realm-profile-app-760.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d5997d7f-bf8b-4572-8f50-8ec4a1f593a7]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=05fd3352-1048-4159-afdb-022a587745f4]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_openid_client.this: Refreshing state... [id=ae380485-b943-4845-898e-c440ff2aa931]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9b32d38f-0fa1-444d-9758-c983f4b34fd0]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5a1a84a7-77cd-4881-aaa5-5fccc3fb0385]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=61f7d821-3022-45a1-aa7d-1217862083eb]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7e3e3945-86e4-48e0-8c60-c9536073e55e]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e63c3de9-dad6-4441-9614-93176ff61d97]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1cc060ef-453a-4b90-b62c-ee9483c7fcd0]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ef6ef143-6ed3-4f32-bc6a-27779bcd9f0b]
module.keycloak_test.module.onestopauth.module.client_sso-test-2-2.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=af4c3876-a275-4eeb-963f-73c505e2923e]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fa46fbc7-df18-4d40-bac8-f90276d596f9]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2cc06bf6-6ce0-403a-a596-f2d85cd3e64d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edc0aa1e-ba42-4b33-9aa0-bcc3c853b22d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c7f560b-d0b7-4451-a70c-b0cff899b3dd]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da101df4-6f77-4730-9aae-e031254c68c6]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=11463c0e-ffcb-4620-90d5-d3bc3453b6b3]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5e74057-c94f-4a30-b18c-84fb1d500477]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=94ff68ca-1fd6-446d-847b-7d6ad9392901]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fe253f42-fa4c-4de5-931c-5d2eb5a06072]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ee5f65ba-c02b-438b-9779-b790910e0db0]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ac4101b1-a5f1-4552-90df-639831c6d7d8]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ce54c332-46a6-4f14-9e3f-be5e5b933ff1]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5a60d017-1041-45de-857a-a86f27c37dea]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d59efa72-b2de-4586-895e-aefce069184c]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3e106a58-cf5c-40bd-b8d8-f6442eddbb6c]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=63937871-a3e2-418d-aee6-947ccafeabe2]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c0560048-7b7c-4259-8ce3-dfee0d977ce5]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ea5c127b-e074-454e-851a-02420ee8bd8b]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=77eec50e-f6ca-48cc-8c8d-6efc4a588bb7]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c0a7a2a-332c-4d7b-82d3-70a8d91c02be]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b03898ff-4879-4215-8a48-14c1a5a1d403]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3b6e76c9-9083-4d86-9ceb-9580c2eda649]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=de9c0fba-8bfb-4aee-a657-421c2984a085]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=22dccf37-6825-49ee-ba44-571c01a6bd39]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=63427cdd-76ac-4c26-b075-780d1386f05a]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2943082f-38ae-4030-a66c-61a8ade9de51]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=26176a12-6339-4490-a705-b7e17253a1ff]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab08314c-ea04-4c22-821d-9040eb74269a]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=161d9e07-d68b-4947-a51c-d692c84846b1]
module.keycloak_prod.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1a312e7e-96c2-41d1-9dd4-dff6b0f4e81f]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4ff00512-dc13-4356-8e0f-8fee2715ce0e]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e71af3b2-7fff-46ec-b395-654d515095b7]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c32ad305-13ab-44bd-83c6-f1d1cb5f4525]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7e2ffc5a-d75c-4af8-ad2f-0e615a9b6cc9]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0268a0bd-210c-4cab-87db-4b4515b740dd]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=b04206d6-d37b-44c9-b76e-2cbddec96ded]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=cfc7b2f4-69dd-4b01-a3cc-bb82a0b1ef3f]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=791fb085-4077-4292-8bd6-089822864060]
module.keycloak_prod.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a872eecf-9d54-4c1a-9700-d3773bc68c47]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=138b27cc-20ca-4387-b3c8-e3678d6b7578]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b9a9c25c-7581-4814-9386-50f8a95d78e4]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8ed88e91-2fa6-4caa-9866-1b7e841c1d2d]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b7ce6f0e-e17e-4773-b298-cdab9e403260]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1f52e6d5-7573-424a-badb-919f8b37b1a1]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=de6759e3-f34a-44f2-80bf-70f389217fee]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=013df6be-f41a-4cd5-b20a-c4bd294472a0]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=036873cc-1079-4bcc-8d80-28fa3eae032e]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6bd54c02-2628-489d-aa5c-3d027abb45da]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=32e4d193-e002-466b-9494-9fc499be1ddd]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5d5f9440-3e5f-49b8-a1bb-8a5229dccc16]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=24194681-e44b-4bb4-890e-f52025105f67]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6486ccdb-4981-4c76-9829-51888ac63f6a]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0dd0e9a1-17a5-4289-9e6b-b7bcf38a831e]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d7e50097-5bff-4e3e-b239-f1145d6e5753]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7a3a2d15-6cd7-44a2-a64b-ce27dc1da650]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0e689aa1-a2ce-4c30-b366-7e79238036a3]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccee6b0d-a27d-45c7-afad-c4dfd345e614]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=77ecb837-262f-4c95-928a-02747857d333]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0b955a72-4cb1-4e12-b22b-d4e669dd18b9]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=47288847-b2d5-4398-8491-7e80aa875e90]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aa5ba504-05e2-4b35-bbdc-f42a96826811]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b39ea164-2a54-487a-9e70-e24bb8725b05]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "demo-feb-10-2905"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "demo-feb-10-2905"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_demo-feb-10-2905.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "demo-feb-10-2905"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "demo-feb-10-2905"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "demo-feb-10-2905"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "demo-feb-10-2905"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_demo-feb-10-2905.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "demo-feb-10-2905"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "demo-feb-10-2905"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https:///www.test.ca/devChange",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 869 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*